stm32duino/Arduino_Core_STM32/boards.txt
# Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX=Generic G031J4Mx
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031J4MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J4MX.build.board=GENERIC_G031J4MX
GenG0.menu.pnum.GENERIC_G031J4MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J4MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX=Generic G031J6Mx
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031J6MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J6MX.build.board=GENERIC_G031J6MX
GenG0.menu.pnum.GENERIC_G031J6MX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J6MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G031K4Tx
GenG0.menu.pnum.GENERIC_G031K4TX=Generic G031K4Tx
GenG0.menu.pnum.GENERIC_G031K4TX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031K4TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K4TX.build.board=GENERIC_G031K4TX
GenG0.menu.pnum.GENERIC_G031K4TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K4TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K6Tx
GenG0.menu.pnum.GENERIC_G031K6TX=Generic G031K6Tx
GenG0.menu.pnum.GENERIC_G031K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031K6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K6TX.build.board=GENERIC_G031K6TX
GenG0.menu.pnum.GENERIC_G031K6TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K6TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K8Tx
GenG0.menu.pnum.GENERIC_G031K8TX=Generic G031K8Tx
GenG0.menu.pnum.GENERIC_G031K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031K8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K8TX.build.board=GENERIC_G031K8TX
GenG0.menu.pnum.GENERIC_G031K8TX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K8TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K4Ux
GenG0.menu.pnum.GENERIC_G031K4UX=Generic G031K4Ux
GenG0.menu.pnum.GENERIC_G031K4UX.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031K4UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K4UX.build.board=GENERIC_G031K4UX
GenG0.menu.pnum.GENERIC_G031K4UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K4UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K6Ux
GenG0.menu.pnum.GENERIC_G031K6UX=Generic G031K6Ux
GenG0.menu.pnum.GENERIC_G031K6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031K6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K6UX.build.board=GENERIC_G031K6UX
GenG0.menu.pnum.GENERIC_G031K6UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K6UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G031K8Ux
GenG0.menu.pnum.GENERIC_G031K8UX=Generic G031K8Ux
GenG0.menu.pnum.GENERIC_G031K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031K8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K8UX.build.board=GENERIC_G031K8UX
GenG0.menu.pnum.GENERIC_G031K8UX.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K8UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041J6Mx
GenG0.menu.pnum.GENERIC_G041J6MX=Generic G041J6Mx
GenG0.menu.pnum.GENERIC_G041J6MX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041J6MX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041J6MX.build.board=GENERIC_G041J6MX
GenG0.menu.pnum.GENERIC_G041J6MX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041J6MX.build.variant=STM32G0xx/G031J(4-6)M_G041J6M

# Generic G041K6Tx
GenG0.menu.pnum.GENERIC_G041K6TX=Generic G041K6Tx
GenG0.menu.pnum.GENERIC_G041K6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041K6TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K6TX.build.board=GENERIC_G041K6TX
GenG0.menu.pnum.GENERIC_G041K6TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K6TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041K8Tx
GenG0.menu.pnum.GENERIC_G041K8TX=Generic G041K8Tx
GenG0.menu.pnum.GENERIC_G041K8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041K8TX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K8TX.build.board=GENERIC_G041K8TX
GenG0.menu.pnum.GENERIC_G041K8TX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K8TX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041K6Ux
GenG0.menu.pnum.GENERIC_G041K6UX=Generic G041K6Ux
GenG0.menu.pnum.GENERIC_G041K6UX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G041K6UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K6UX.build.board=GENERIC_G041K6UX
GenG0.menu.pnum.GENERIC_G041K6UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K6UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G041K8Ux
GenG0.menu.pnum.GENERIC_G041K8UX=Generic G041K8Ux
GenG0.menu.pnum.GENERIC_G041K8UX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G041K8UX.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G041K8UX.build.board=GENERIC_G041K8UX
GenG0.menu.pnum.GENERIC_G041K8UX.build.product_line=STM32G041xx
GenG0.menu.pnum.GENERIC_G041K8UX.build.variant=STM32G0xx/G031K(4-6-8)(T-U)_G041K(6-8)(T-U)

# Generic G071R6Tx
GenG0.menu.pnum.GENERIC_G071R6TX=Generic G071R6Tx
GenG0.menu.pnum.GENERIC_G071R6TX.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071R6TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R6TX.build.board=GENERIC_G071R6TX
GenG0.menu.pnum.GENERIC_G071R6TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R6TX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071R8Tx
GenG0.menu.pnum.GENERIC_G071R8TX=Generic G071R8Tx
GenG0.menu.pnum.GENERIC_G071R8TX.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071R8TX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R8TX.build.board=GENERIC_G071R8TX
GenG0.menu.pnum.GENERIC_G071R8TX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R8TX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

