stm32duino/Arduino_Core_STM32/boards.txt
# Generic H747AIIx
GenH7.menu.pnum.GENERIC_H747AIIX=Generic H747AIIx
GenH7.menu.pnum.GENERIC_H747AIIX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H747AIIX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747AIIX.build.board=GENERIC_H747AIIX
GenH7.menu.pnum.GENERIC_H747AIIX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747AIIX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H747IGTx
GenH7.menu.pnum.GENERIC_H747IGTX=Generic H747IGTx
GenH7.menu.pnum.GENERIC_H747IGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H747IGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747IGTX.build.board=GENERIC_H747IGTX
GenH7.menu.pnum.GENERIC_H747IGTX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747IGTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H747IITx
GenH7.menu.pnum.GENERIC_H747IITX=Generic H747IITx
GenH7.menu.pnum.GENERIC_H747IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H747IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747IITX.build.board=GENERIC_H747IITX
GenH7.menu.pnum.GENERIC_H747IITX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747IITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H750IBKx
GenH7.menu.pnum.GENERIC_H750IBKX=Generic H750IBKx
GenH7.menu.pnum.GENERIC_H750IBKX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750IBKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750IBKX.build.board=GENERIC_H750IBKX
GenH7.menu.pnum.GENERIC_H750IBKX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750IBKX.build.variant=STM32H7xx/H743I(G-I)(K-T)_H750IBK_H753II(K-T)

# Generic H750VBTx
GenH7.menu.pnum.GENERIC_H750VBTX=Generic H750VBTx
GenH7.menu.pnum.GENERIC_H750VBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750VBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750VBTX.build.board=GENERIC_H750VBTX
GenH7.menu.pnum.GENERIC_H750VBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750VBTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H750ZBTx
GenH7.menu.pnum.GENERIC_H750ZBTX=Generic H750ZBTx
GenH7.menu.pnum.GENERIC_H750ZBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750ZBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750ZBTX.build.board=GENERIC_H750ZBTX
GenH7.menu.pnum.GENERIC_H750ZBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750ZBTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H753IIKx
GenH7.menu.pnum.GENERIC_H753IIKX=Generic H753IIKx
GenH7.menu.pnum.GENERIC_H753IIKX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753IIKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753IIKX.build.board=GENERIC_H753IIKX
GenH7.menu.pnum.GENERIC_H753IIKX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753IIKX.build.variant=STM32H7xx/H743I(G-I)(K-T)_H750IBK_H753II(K-T)

# Generic H753IITx
GenH7.menu.pnum.GENERIC_H753IITX=Generic H753IITx
GenH7.menu.pnum.GENERIC_H753IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753IITX.build.board=GENERIC_H753IITX
GenH7.menu.pnum.GENERIC_H753IITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753IITX.build.variant=STM32H7xx/H743I(G-I)(K-T)_H750IBK_H753II(K-T)

# Generic H753VIHx
GenH7.menu.pnum.GENERIC_H753VIHX=Generic H753VIHx
GenH7.menu.pnum.GENERIC_H753VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753VIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753VIHX.build.board=GENERIC_H753VIHX
GenH7.menu.pnum.GENERIC_H753VIHX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753VIHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H753VITx
GenH7.menu.pnum.GENERIC_H753VITX=Generic H753VITx
GenH7.menu.pnum.GENERIC_H753VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753VITX.build.board=GENERIC_H753VITX
GenH7.menu.pnum.GENERIC_H753VITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H753ZITx
GenH7.menu.pnum.GENERIC_H753ZITX=Generic H753ZITx
GenH7.menu.pnum.GENERIC_H753ZITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753ZITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753ZITX.build.board=GENERIC_H753ZITX
GenH7.menu.pnum.GENERIC_H753ZITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753ZITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H757AIIx
GenH7.menu.pnum.GENERIC_H757AIIX=Generic H757AIIx
GenH7.menu.pnum.GENERIC_H757AIIX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757AIIX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757AIIX.build.board=GENERIC_H757AIIX
GenH7.menu.pnum.GENERIC_H757AIIX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757AIIX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H757IITx
GenH7.menu.pnum.GENERIC_H757IITX=Generic H757IITx
GenH7.menu.pnum.GENERIC_H757IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757IITX.build.board=GENERIC_H757IITX
GenH7.menu.pnum.GENERIC_H757IITX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757IITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=0
GenH7.menu.upload_method.swdMethod.upload.options=-g
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=1
GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=2
GenH7.menu.upload_method.dfuMethod.upload.options=-g
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic L0
GenL0.name=Generic STM32L0 series

GenL0.build.core=arduino
GenL0.build.board=GenL0
GenL0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenL0.build.mcu=cortex-m0plus
GenL0.build.series=STM32L0xx
GenL0.build.cmsis_lib_gcc=arm_cortexM0l_math

# ThunderPack
GenL0.menu.pnum.THUNDERPACK_L072=ThunderPack v1.0
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_size=196608
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_data_size=20480
GenL0.menu.pnum.THUNDERPACK_L072.build.board=THUNDERPACK_L072
GenL0.menu.pnum.THUNDERPACK_L072.build.product_line=STM32L072xx
GenL0.menu.pnum.THUNDERPACK_L072.build.variant_h=variant_{build.board}.h
GenL0.menu.pnum.THUNDERPACK_L072..build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenL0.menu.pnum.THUNDERPACK_L072.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T

# Piconomix PX-HER0 board
GenL0.menu.pnum.PX_HER0=PX-HER0
GenL0.menu.pnum.PX_HER0.upload.maximum_size=131072
GenL0.menu.pnum.PX_HER0.upload.maximum_data_size=20480
GenL0.menu.pnum.PX_HER0.build.board=PX_HER0
GenL0.menu.pnum.PX_HER0.build.product_line=STM32L072xx
GenL0.menu.pnum.PX_HER0.build.variant_h=variant_{build.board}.h
GenL0.menu.pnum.PX_HER0.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
GenL0.menu.pnum.PX_HER0.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Generic L010RBTx
GenL0.menu.pnum.GENERIC_L010RBTX=Generic L010RBTx
GenL0.menu.pnum.GENERIC_L010RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L010RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L010RBTX.build.board=GENERIC_L010RBTX
GenL0.menu.pnum.GENERIC_L010RBTX.build.product_line=STM32L010xB
GenL0.menu.pnum.GENERIC_L010RBTX.build.variant=STM32L0xx/L010RBT

# Generic L031K4Tx
GenL0.menu.pnum.GENERIC_L031K4TX=Generic L031K4Tx
GenL0.menu.pnum.GENERIC_L031K4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031K4TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031K4TX.build.board=GENERIC_L031K4TX
GenL0.menu.pnum.GENERIC_L031K4TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031K4TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T

# Generic L031K6Tx
GenL0.menu.pnum.GENERIC_L031K6TX=Generic L031K6Tx
GenL0.menu.pnum.GENERIC_L031K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031K6TX.build.board=GENERIC_L031K6TX
GenL0.menu.pnum.GENERIC_L031K6TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031K6TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T

# Generic L041K6Tx
GenL0.menu.pnum.GENERIC_L041K6TX=Generic L041K6Tx
GenL0.menu.pnum.GENERIC_L041K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L041K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L041K6TX.build.board=GENERIC_L041K6TX
GenL0.menu.pnum.GENERIC_L041K6TX.build.product_line=STM32L041xx
GenL0.menu.pnum.GENERIC_L041K6TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T

# Generic L051C6Tx
GenL0.menu.pnum.GENERIC_L051C6TX=Generic L051C6Tx
GenL0.menu.pnum.GENERIC_L051C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C6TX.build.board=GENERIC_L051C6TX
GenL0.menu.pnum.GENERIC_L051C6TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C6TX.build.variant=STM32L0xx/L051C(6-8)(T-U)

# Generic L051C6Ux
GenL0.menu.pnum.GENERIC_L051C6UX=Generic L051C6Ux
GenL0.menu.pnum.GENERIC_L051C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L051C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C6UX.build.board=GENERIC_L051C6UX
GenL0.menu.pnum.GENERIC_L051C6UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C6UX.build.variant=STM32L0xx/L051C(6-8)(T-U)

# Generic L051C8Tx
GenL0.menu.pnum.GENERIC_L051C8TX=Generic L051C8Tx
GenL0.menu.pnum.GENERIC_L051C8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051C8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C8TX.build.board=GENERIC_L051C8TX
GenL0.menu.pnum.GENERIC_L051C8TX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C8TX.build.variant=STM32L0xx/L051C(6-8)(T-U)

