stm32duino/Arduino_Core_STM32/boards.txt
# Generic L051C8Ux
GenL0.menu.pnum.GENERIC_L051C8UX=Generic L051C8Ux
GenL0.menu.pnum.GENERIC_L051C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L051C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L051C8UX.build.board=GENERIC_L051C8UX
GenL0.menu.pnum.GENERIC_L051C8UX.build.product_line=STM32L051xx
GenL0.menu.pnum.GENERIC_L051C8UX.build.variant=STM32L0xx/L051C(6-8)(T-U)

# Generic L052R6Tx
GenL0.menu.pnum.GENERIC_L052R6TX=Generic L052R6Tx
GenL0.menu.pnum.GENERIC_L052R6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052R6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R6TX.build.board=GENERIC_L052R6TX
GenL0.menu.pnum.GENERIC_L052R6TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R6TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L052R8Tx
GenL0.menu.pnum.GENERIC_L052R8TX=Generic L052R8Tx
GenL0.menu.pnum.GENERIC_L052R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R8TX.build.board=GENERIC_L052R8TX
GenL0.menu.pnum.GENERIC_L052R8TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R8TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L053R6Tx
GenL0.menu.pnum.GENERIC_L053R6TX=Generic L053R6Tx
GenL0.menu.pnum.GENERIC_L053R6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L053R6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053R6TX.build.board=GENERIC_L053R6TX
GenL0.menu.pnum.GENERIC_L053R6TX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053R6TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L053R8Tx
GenL0.menu.pnum.GENERIC_L053R8TX=Generic L053R8Tx
GenL0.menu.pnum.GENERIC_L053R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L053R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053R8TX.build.board=GENERIC_L053R8TX
GenL0.menu.pnum.GENERIC_L053R8TX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053R8TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L063R8Tx
GenL0.menu.pnum.GENERIC_L063R8TX=Generic L063R8Tx
GenL0.menu.pnum.GENERIC_L063R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L063R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L063R8TX.build.board=GENERIC_L063R8TX
GenL0.menu.pnum.GENERIC_L063R8TX.build.product_line=STM32L063xx
GenL0.menu.pnum.GENERIC_L063R8TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L072CBYx
GenL0.menu.pnum.GENERIC_L072CBYX=Generic L072CBYx
GenL0.menu.pnum.GENERIC_L072CBYX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072CBYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CBYX.build.board=GENERIC_L072CBYX
GenL0.menu.pnum.GENERIC_L072CBYX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CBYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY

# Generic L072CZEx
GenL0.menu.pnum.GENERIC_L072CZEX=Generic L072CZEx
GenL0.menu.pnum.GENERIC_L072CZEX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072CZEX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CZEX.build.board=GENERIC_L072CZEX
GenL0.menu.pnum.GENERIC_L072CZEX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CZEX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY

# Generic L072CZYx
GenL0.menu.pnum.GENERIC_L072CZYX=Generic L072CZYx
GenL0.menu.pnum.GENERIC_L072CZYX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072CZYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072CZYX.build.board=GENERIC_L072CZYX
GenL0.menu.pnum.GENERIC_L072CZYX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072CZYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY

# Generic L072KBTx
GenL0.menu.pnum.GENERIC_L072KBTX=Generic L072KBTx
GenL0.menu.pnum.GENERIC_L072KBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072KBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072KBTX.build.board=GENERIC_L072KBTX
GenL0.menu.pnum.GENERIC_L072KBTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072KBTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T

# Generic L072KZTx
GenL0.menu.pnum.GENERIC_L072KZTX=Generic L072KZTx
GenL0.menu.pnum.GENERIC_L072KZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072KZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072KZTX.build.board=GENERIC_L072KZTX
GenL0.menu.pnum.GENERIC_L072KZTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072KZTX.build.variant=STM32L0xx/L072K(B-Z)T_L082K(B-Z)T

# Generic L072RBTx
GenL0.menu.pnum.GENERIC_L072RBTX=Generic L072RBTx
GenL0.menu.pnum.GENERIC_L072RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L072RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RBTX.build.board=GENERIC_L072RBTX
GenL0.menu.pnum.GENERIC_L072RBTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RBTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

# Generic L072RZTx
GenL0.menu.pnum.GENERIC_L072RZTX=Generic L072RZTx
GenL0.menu.pnum.GENERIC_L072RZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L072RZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L072RZTX.build.board=GENERIC_L072RZTX
GenL0.menu.pnum.GENERIC_L072RZTX.build.product_line=STM32L072xx
GenL0.menu.pnum.GENERIC_L072RZTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

# Generic L073CZYx
GenL0.menu.pnum.GENERIC_L073CZYX=Generic L073CZYx
GenL0.menu.pnum.GENERIC_L073CZYX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073CZYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073CZYX.build.board=GENERIC_L073CZYX
GenL0.menu.pnum.GENERIC_L073CZYX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073CZYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY

# Generic L073RBTx
GenL0.menu.pnum.GENERIC_L073RBTX=Generic L073RBTx
GenL0.menu.pnum.GENERIC_L073RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L073RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073RBTX.build.board=GENERIC_L073RBTX
GenL0.menu.pnum.GENERIC_L073RBTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073RBTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

# Generic L073RZTx
GenL0.menu.pnum.GENERIC_L073RZTX=Generic L073RZTx
GenL0.menu.pnum.GENERIC_L073RZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073RZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073RZTX.build.board=GENERIC_L073RZTX
GenL0.menu.pnum.GENERIC_L073RZTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073RZTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

